{
	"online":true,
	"halloween_event":true,
	"winter_event":true,
	"welcome": "Welcome to Marble Blast Online!\nYou can chat with other users currently on, <a:MarbleBlast.com>the Marble Blast webchat</a>, PlatinumQuest and Marble Blast Fubar, and see everyone's status!\nType \" /help \" (without the quotes) for more chat commands and basic usage.\nIf you have any questions or require assistance, please submit a support request on the Marble Blast website.\n\nWe have an official Discord server! To join, use <a:discord.gg/frdRunh>this link</a>.\n\nEnjoy your stay!\n- Marble Blast Community Staff",
	"chat_help_info": "For a command listing, type '\/help cmdlist',\\nRemove the apostrophes when you type the above commands.",
	"chat_help_cmdlist":"You can use certain commands on the chat! For the examples we will use the usernames of Jeff and HiGuy.\n/me - Use this if you want to give a message using your username in front without the colons.\nFor example, '/me likes Marble Blast!' will show up as 'Jeff likes Marble Blast!'\n/slap - Want to slap someone with a large trout? Use this then!\nFor example, '/slap Jeff' will show up for Jeff as: HiGuy slaps Jeff around a bit with a large trout!\n/whisper - Use this to send a private message to someone. You can find peoples' usernames with /who.\nFor example, '/whisper Jeff I like Marble Blast!' will show up for Jeff as: (From: HiGuy) I like Marble Blast!\nIf you don't want to type out /whisper, you can alternatively use these:\n/msg PlayerName Message . For example: '/msg Jeff I like Marble Blast!'\n@@PlayerName Message . For example: '@@Jeff I like Marble Blast!'\n@@@Message will reply to the last user who messaged you.\n/mute - Use this command to check your muted status/time.\n/ping - Use this command to check if you are still connected to the server. You will get a message back if you haven't disconnected.\n/who - Will display info about the players online. Use /who <player> to see more information about a specific player.\n/prefix list - List all the available prefixes\n/prefix set <prefix> - Set your prefix to <prefix>\n/suffix list - List all the available suffixes\n/suffix set <suffix> - Set your suffix to <suffix>\n/flair list - List all the available flairs\n/flair set <flair> - Set your flair to <flair>\n/color <color: hex> = Set your color to <color> where <color> is the hex color code\n\nDon't forget to check out the Options menu to bind server chat (defaulted to 'P' button) and global chat (defaulted to 'T') to any key you want, and remember to not use the apostrophe like in the examples above!",
	"history_count":20,
	"default_name": "Nardo Polo",
	"april20_uid":0,
	"show_wr_messages":true,
	"april20_chance":0.2,
	"show_egg_wr_messages":true,
	"wr_player_count":20,

	"PQServer": "localhost:1337",
	"webchatServer": "localhost:420",
	"mpMasterServer": "localhost:666",

	"webchatWebhook": "",
	"errorWebhook": "",

	"gameVersion": 9000,

	"chat_colors": [
		{ "key": "0", "value": "000000" },
		{ "key": "1", "value": "ff0000" },
		{ "key": "2", "value": "00ff00" },
		{ "key": "3", "value": "0000ff" },
		{ "key": "4", "value": "009999" },
		{ "key": "5", "value": "999900" },
		{ "key": "6", "value": "990099" },
		{ "key": "7", "value": "804300" },
		{ "key": "8", "value": "8000ff" },
		{ "key": "9", "value": "80ff00" },
		{ "key": "a", "value": "ff8000" },
		{ "key": "b", "value": "999999" },
		{ "key": "c", "value": "333333" },
		{ "key": "d", "value": "008040" },
		{ "key": "e", "value": "ff00ff" },
		{ "key": "f", "value": "00a0ff" }
	],
	
	"chat_statuses": [
		"",
		"(Level Select)",
		"(Playing)",
		"(Webchat)",
		"(Challenge)",
		"(Super Challenge)",
		"(Hosting)",
		"(Game Lobby)",
		"(Dedicated)",
		"(Away)",
		"(Fubar)",
		"(Busy)",
		"(Multiplayer)",
		"(PQ Dev)",
		"(Derp)",
		"(Ultra)",
		"(Dev Server)",
		"(Mmm Sweet Lemonade!)",
		"(Hi, Mom!)",
		"(Party)",
		"(Discord)"
	],

	"chat_flairs": [
		"",
		"platinum",
		"wrench",
		"binary",
		"deadbeef",
		"fubar",
		"gold",
		"mbp",
		"pq",
		"trophy",
		"where",
		"redwinterhat",
		"greenwinterhat",
		"bluewinterhat",
		"purplewinterhat",
		"globe",
		"token",
		"gem",
		"speedboostair",
		"cake",
		"music",
		"beachball",
		"trophy-2",
		"trophy-3",
		"trophy-4",
		"trophy-5",
		"trophy-6",
		"trophy-7",
		"candy",
		"oct1",
		"oct2",
		"trap",
		"dd",
		"snowball",
		"gingerbread",
		"yellowwinterhat",
		"prismaticwinterhat",
		"orangewinterhat",
		"darkgreenwinterhat",
		"newyear",
		"spaceship",
		"globe15",
		"xbox",
		"plunge",
		"construction",
		"rings",
		"globe16",
		"dragon",
		"ultra",
		"music",
		"ghost",
		"globe17",
		"winterophy",
		"Mirthful",
		"Trophy_PQ_1_Flair",
		"Trophy_PQ_2_Flair",
		"Trophy_PQ_3_Flair",
		"Trophy_PQ_4_Flair",
		"Trophy_PQ_5_Flair",
		"Trophy_PQ_6_Flair",
		"Trophy_PQ_7_Flair",
		"Trophy_PQ_8_Flair",
		"Trophy_PQ_9_Flair",
		"Trophy_PQ_10_Flair",
		"Trophy_PQ_11_Flair",
		"Trophy_PQ_12_Flair",
		"Trophy_PQ_13_Flair",
		"Trophy_PQ_14_Flair",
		"Trophy_PQ_15_Flair",
		"Trophy_PQ_16_Flair",
		"Trophy_PQ_17_Flair",
		"Trophy_PQ_18_Flair",
		"Trophy_PQ_19_Flair",
		"Trophy_PQ_20_Flair",
		"Trophy_PQ_21_Flair",
		"Trophy_PQ_22_Flair",
		"Trophy_PQ_23_Flair",
		"Trophy_PQ_24_Flair",
		"Trophy_PQ_25_Flair",
		"Trophy_Frightfest_Flair",
		"Trophy_Winterfest_Flair",
		"quiz_m","FLAIR PQBronze",
		"PQSilver","FLAIR PQGold",
		"PQPlatinum",
		"nestEgg",
		"gemBlue",
		"gemPlatinum",
		"gemPurple",
		"gemRed",
		"gemTeal",
		"gemYellow",
		"bubble",
		"anvil",
		"fireball",
		"rbyGem",
		"guitar"
	],

	"jokes": [
		"The last thing I want to do is hurt you. But it''s still on the list.", 
		"We live in a society where pizza gets to your house before the police.", 
		"Light travels faster than sound. This is why some people appear bright until you hear them speak.", 
		"If I agreed with you, we''d both be wrong.", 
		"If a bus station is where a bus stops, and a train station is where a train stops, then what happens at my workstation?", 
		"I thought I wanted a career, turns out I just wanted paychecks.", 
		"Some people are like Slinkies ... not really good for anything, but you can''t help smiling when you see one tumble down the stairs.", 
		"A computer once beat me at chess, but it was no match for me at kick boxing.", 
		"The voices in my head may not be real, but they have some good ideas!", 
		"Laugh at your problems, everybody else does.", 
		"Never hit a man with glasses. Hit him with a baseball bat.", 
		"It''s not the fall that kills you; it''s the sudden stop at the end.", 
		"You do not need a parachute to skydive. You only need a parachute to skydive twice.", 
		"I intend to live forever. So far, so good.", 
		"Money can''t buy happiness, but it sure makes misery easier to live with.", 
		"With sufficient thrust, pigs fly just fine.", 
		"Worrying works! 90% of the things I worry about never happen.", 
		"Knowledge is power, and power corrupts. So study hard and be evil.", 
		"If at first you don''t succeed, skydiving is not for you!", 
		"I used to be indecisive. Now I''m not sure.", 
		"When in doubt, mumble.", 
		"I like work. It fascinates me. I sit and look at it for hours.", 
		"Change is inevitable, except from a vending machine.", 
		"If winning isn''t everything, why do they keep score?", 
		"What did one ocean say to the other ocean? Nothing, they just waved.", 
		"What is faster, hot or cold? Hot, because you can catch a cold.", 
		"When everything''s coming your way, you''re in the wrong lane.", 
		"Whenever I find the key to success, someone changes the lock.", 
		"Time flies like an arrow; fruit flies like a banana.", 
		"When tempted to fight fire with fire, remember that the Fire Department usually uses water.", 
		"Did you know that autopsy is a dying practice?", 
		"All those who believe in psychokinesis raise my hand.", 
		"OK, so what''s the speed of dark?", 
		"How do you tell when you''re out of invisible ink?", 
		"Hard work pays off in the future. Laziness pays off now.", 
		"Many people quit looking for work when they find a job.", 
		"Eagles may soar, but weasels don''t get sucked into jet engines.", 
		"Who is General Failure and why is he reading my hard disk?", 
		"I couldn''t repair your brakes, so I made your horn louder.", 
		"Plan to be spontaneous tomorrow.", 
		"42.7 percent of all statistics are made up on the spot.", 
		"Bills travel through the mail at twice the speed of checks.", 
		"On the other hand, you have different fingers.", 
		"Someone sent me a postcard picture of the earth. On the back it said, -Wish you were here.-", 
		"I spilled spot remover on my dog. Now he''s gone.", 
		"It''s a small world, but I wouldn''t want to have to paint it.", 
		"Right now I''m having amnesia and deja vu at the same time.", 
		"You can''t have everything. Where would you put it?", 
		"I planted some bird seed. A bird came up. Now I don''t know what to feed it.", 
		"I bought a million lottery tickets. I won a dollar.", 
		"Yesterday I told a chicken to cross the road. It said, -What for?-", 
		"I got a garage door opener. It can''t close. Just open.", 
		"The sky is falling...no, I''m tipping over backwards.", 
		"I had some eyeglasses. I was walking down the street when suddenly the prescription ran out.", 
		"What was Forrest Gump''s email password? 1forrest1", 
		"If anything is possible, is it possible for something to be impossible?", 
		"STRESSED is just DESSERTS spelled backward.", 
		"What do bees do with their honey? They cell it.", 
		"I''m going to tell you about procrastination. Eventually.", 
		"You gotta hand it to short people...", 
		"I was using an ATM, but it didn''t make cents.", 
		"Did you hear about Pangea''s break up?", 
		"How many times do I have to cry Wolf before Animal Control shows up?", 
		"Jeff tried coding once. We try not to mention it.", 
		"The quality of these jokes. That''s the real joke.", 
		"Do you know why, when geese fly in a V, one side of the V is longer than the other? Because there are more geese on that side.", 
		"What''s the difference between a well dressed man on a unicycle and a poorly dressed man on a bike? Attire.", 
		"Why is a giraffe''s neck so long? Because it''s head is so far from its body.", 
		"What''s the stupidest animal in the jungle? A polar bear", 
		"I need to get rid of my spine, it''s holding me back.", 
		"What''s grey and can''t swim? A castle.", 
		"What''s yellow and hurts when it gets in your eye? A bulldozer.", 
		"What''s red and bad for your teeth? A brick.", 
		"What''s brown and rhymes with \"snoop?\" Dr. Dre", 
		"What''s white and can''t climb a tree? A refrigerator.", 
		"If I had to describe myself with one word it would be \"bad at following directions\".", 
		"How do you think the unthinkable? With an itheberg.", 
		"What did batman say to robin before they got in the batmobile? \"Get in the batmobile.\"", 
		"When is a door not a door? When it''s ajar.", 
		"When is a car not a car? When it turns into a driveway!", 
		"Why do you bake cookies and cook bacon?", 
		"Why don''t ants get sick? Because they have little anty-bodies.", 
		"What animal can jump higher than a house? All of them... houses can''t jump.", 
		"Did you hear about the two thieves who stole a calendar? They each got 6 months", 
		"Why don''t you ever see elephants hiding in trees? Because they''re good at it.", 
		"Why did the plane crash? Because the pilot was a loaf of bread.", 
		"Why is Peter Pan always flying? Because he never lands.", 
		"Why can''t dinosaurs clap? Because they''re dead.", 
		"I, for one, like Roman numerals.", 
		"I have an inferiority complex, but it''s not a very good one.", 
		"I have a phobia of over-engineered buildings - it''s a complex complex complex.", 
		"When my friend told me to stop acting like a flamingo I had to put my foot down.", 
		"You can never lose a homing pigeon - if your homing pigeon doesn''t come back, what you''ve lost is a pigeon.", 
		"A man walked into his house and was delighted when he discovered that someone had stolen all of his lamps.", 
		"A plateau is the highest form of flattery", 
		"I haven''t slept for ten days, because that would be too long.", 
		"I''m against picketing but I don''t know how to show it.", 
		"Not only is my thesaurus terrible, but it''s also terrible.", 
		"I used to be indecisive, but now I''m not sure.", 
		"What do you get when you cross a joke and a rhetorical question?", 
		"I stayed up all night wondering where the sun was, and then it dawned on me.", 
		"The guy who invented autocorrect has died... restaurant in piece", 
		"I changed my password to 'incorrect', that way, when I forget, my computer reminds me.", 
		"I hate being bipolar, it''s awesome.", 
		"I told a woman that she painted her eyebrows on too high. She looked surprised.", 
		"Inspecting mirrors is a job I could easily see myself doing.", 
		"I decided to sell my vacuum cleaner, because it was just collecting dust.", 
		"I got an A on my origami assignment when I turned my paper into my teacher.", 
		"A dyslexic man walked into a bra. His wife''s washing was hanging out to dry and he wasn''t looking where he was going. The man''s dyslexia was admittedly pretty irrelevant to the event.",
		"This quality of this server's script.",
		"How much time went into writing these jokes that could have been spent on PQ instead."
	]
}